# YOLOv8-seg + CoordAtt at Position C (after every Neck C2f)
# Attention: Coordinate Attention, Position: Neck特征融合阶段（4处）
# Backbone完全不变，预训练权重100%兼容

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, Conv, [256, 3, 2]]       # 3-P3/8
  - [-1, 6, C2f, [256, True]]        # 4
  - [-1, 1, Conv, [512, 3, 2]]       # 5-P4/16
  - [-1, 6, C2f, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]      # 7-P5/32
  - [-1, 3, C2f, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]         # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, Concat, [1]]                     # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                           # 12
  - [-1, 1, CoordAtt, [512]]                      # 13 ← CoordAtt on P4 fusion

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 14
  - [[-1, 4], 1, Concat, [1]]                     # 15 cat backbone P3
  - [-1, 3, C2f, [256]]                           # 16
  - [-1, 1, CoordAtt, [256]]                      # 17 ← CoordAtt on P3 fusion

  - [-1, 1, Conv, [256, 3, 2]]                    # 18
  - [[-1, 13], 1, Concat, [1]]                    # 19 cat head P4 (CoordAtt #13)
  - [-1, 3, C2f, [512]]                           # 20
  - [-1, 1, CoordAtt, [512]]                      # 21 ← CoordAtt on P4 output

  - [-1, 1, Conv, [512, 3, 2]]                    # 22
  - [[-1, 9], 1, Concat, [1]]                     # 23 cat backbone P5 (SPPF #9)
  - [-1, 3, C2f, [1024]]                          # 24
  - [-1, 1, CoordAtt, [1024]]                     # 25 ← CoordAtt on P5 output

  - [[17, 21, 25], 1, Segment, [nc, 32, 256]]     # 26 Segment(P3, P4, P5)
